{
  "by_name": {
    "W1L2 - Phan et al. (2024) [EN].mp3": {
      "summary_lines": [
        "Phan et al. argue that the nomothetic-idiographic distinction alone is too coarse to organize contemporary personality research.",
        "They propose a 2x3 framework based on focal entity (person vs population) and type of generalization (none, entity-specific, cross-entity).",
        "The paper aims to improve conceptual precision so research questions, methods, and inferences are better aligned."
      ],
      "key_points": [
        "Nomothetic and idiographic labels are often conflated with unrelated methodological choices.",
        "A matrix-based taxonomy clarifies inferential goals across study designs.",
        "Generalization targets should be specified explicitly at design stage.",
        "The framework is intended as a decision aid across the empirical workflow."
      ],
      "meta": {
        "status": "filled",
        "method": "manual_from_pdf_v1",
        "source_file": "notebooklm-podcast-auto/personlighedspsykologi/sources/W1L2 Personality assessment/W1L2 Phan et al. (2024).pdf"
      }
    },
    "W3L1 - Kandler & Instinske (2025) [EN].mp3": {
      "summary_lines": [
        "This review synthesizes evidence that personality differences are shaped by many small genetic and environmental influences rather than single dominant causes.",
        "It emphasizes that broad trait scores can hide specific mechanisms and that measurement strategy strongly affects what effects are detected.",
        "The authors call for multimodal, multi-perspective designs that model gene-environment interplay more directly."
      ],
      "key_points": [
        "Personality architecture appears polygenic and poly-environmental.",
        "Single-factor explanations have weak explanatory power for trait variance.",
        "Operationalization choices influence observed genetic and environmental effects.",
        "Future research should target interaction effects and person-specific pathways."
      ],
      "meta": {
        "status": "filled",
        "method": "manual_from_pdf_v1",
        "source_file": "notebooklm-podcast-auto/personlighedspsykologi/sources/W3L1 Culture, evolution, genetics, and personality/W3L1 Kandler & Instinske (2025).pdf"
      }
    },
    "W4L2 - Laplanche, J. (1970). Liv og død i psykoanalysen (pp. 18‐38) [EN].mp3": {
      "summary_lines": [
        "Laplanche introduces a historical-structural reading of Freud that treats contradictions in psychoanalytic theory as theoretically productive rather than accidental.",
        "He argues that tensions in concepts like drive, ego, and object should be interpreted dialectically as clues to the object of psychoanalysis.",
        "The text positions psychoanalytic theory as evolving through conceptual crises tied to both clinical and metapsychological problems."
      ],
      "key_points": [
        "Freud is read through latent structural contradictions, not only explicit doctrine.",
        "Contradictions can signal deeper problems in the theory of the object.",
        "Drive theory is examined through the relation between aim, object, and process.",
        "Methodologically, interpretation requires sustained attention to conceptual reversals."
      ],
      "meta": {
        "status": "filled",
        "method": "manual_from_pdf_v1",
        "source_file": "notebooklm-podcast-auto/personlighedspsykologi/sources/W4L2 Psykoanalytisk personlighedsstruktur/W4L2 Laplanche, J. (1970). Liv og død i psykoanalysen (pp. 18‐38).pdf"
      }
    },
    "W5L1 - Ricoeur (1981) [EN].mp3": {
      "summary_lines": [
        "Ricoeur examines how psychoanalysis can justify truth claims when its data are interpretive, transferential, and bound to the analytic situation.",
        "He argues that standard natural-science verification models are insufficient for psychoanalytic theory and practice.",
        "The chapter reframes proof through the relation between interpretation, treatment process, and the specific kinds of facts analytic work can produce."
      ],
      "key_points": [
        "The central issue is what counts as a fact in psychoanalysis.",
        "Theory, investigation, and treatment are epistemically intertwined.",
        "Transference and interpretation are not noise but part of the evidential structure.",
        "Psychoanalytic validation requires criteria beyond simple falsification models."
      ],
      "meta": {
        "status": "filled",
        "method": "manual_from_pdf_v1",
        "source_file": "notebooklm-podcast-auto/personlighedspsykologi/sources/W5L1 Empiri og metode i psykoanalysen/W5L1 Ricoeur (1981).pdf"
      }
    },
    "W7L2 - Giorgi (2005) [EN].mp3": {
      "summary_lines": [
        "Giorgi argues that humanistic psychology was a necessary correction to reductionist behaviorist and orthodox psychoanalytic models.",
        "He claims the field still relies too heavily on natural-science assumptions and needs methods that fit lived human meaning.",
        "The essay proposes a stronger alliance between humanistic psychology and phenomenology to study persons nonreductionistically."
      ],
      "key_points": [
        "Humanistic psychology restored the person as a central unit of analysis.",
        "Mainstream psychological methods can miss specifically human meanings and contexts.",
        "Phenomenology offers methodical tools for rigorous, person-centered inquiry.",
        "A core challenge is building human-science methods with epistemic credibility."
      ],
      "meta": {
        "status": "filled",
        "method": "manual_from_pdf_v1",
        "source_file": "notebooklm-podcast-auto/personlighedspsykologi/sources/W7L2 Humanistisk psykologi/W7L2 Giorgi (2005).pdf"
      }
    }
  }
}
